[
  {
    "content_description": "Just hope to walk in the sun hand in hand, which symbolizes the core of the story, is like a beautiful cover. With countless messy, depressed and sad story fragments, they are restored one by one like documentaries: there is no infatuation, no withering sea and stone, only a cold and desperate trick, and the last trace of warmth is completely abandoned, Thousands of readers are sad and moved in a sad love for the redemption of evil.",
    "ISBN": "978754424251",
    "name": "Under the Midnight Sun",
    "author": "Higashino keigo",
    "price": "5.00",
    "press": "Nanhai publishing company",
    "score": "9.1",
    "link": "https://book.douban.com/subject/3259440/",
    "author_profile": "Higashino keigo is a famous Japanese writer. Born in Osaka in 1958. In 1985, he made his debut with the award-winning work after school of the 31st Edogawa random walk award and began to become famous. After the publication of 《Under the Mignight Sun》, it caused a great sensation and made Higashino keigo a top level writer. The novel was adapted into a TV series of the same name, which, together with books, brought a wave of praise to the writer, making him one of the most popular writers in Japan, South Korea and Taiwan.",
    "date": "2008-9",
    "page": "467",
    "cover": "MidnightUnderTheSun.jpg"
  },
  {
    "content_description": "This is a touching, gentle, elegant and slightly sentimental love novel. The protagonist Watanabe unfolds his love entanglement with two girls in the first person. During this period, Watanabe was very depressed and hesitant. On the one hand, he never forgets Naoko's lingering illness and tenderness, on the other hand, it is difficult to resist Lvzi's bold confession and charming vitality. Soon came the sad news of Naoko's suicide, and Watanabe went hiking everywhere. Finally, with the encouragement of Zhizi's roommate Lingzi, he began to explore his later life.",
    "ISBN": "978753272569",
    "name": "Norwegian Wood",
    "author": "Haruki Murakami",
    "price": "6.00",
    "press": "Shanghai Translation Publishing House",
    "score": "8.0",
    "link": "https://book.douban.com/subject/1046265/",
    "author_profile": "Haruki Murakami is a Japanese novelist. He studied drama in the Department of literature, Waseda University. His creation is not bound by tradition, with novel ideas, natural and unrestrained writing, but not vulgar and shallow. In particular, he has more characteristics in depicting people's loneliness and helplessness. Instead of writing this emotion as a negative thing, he sublimates it into an elegant style and a realm of enjoyment through inner mental operation, so as to provide readers, especially people living in cities, with a life mode or life experience.",
    "date": "2001-2",
    "page": "350",
    "cover": "Wood.jpg"
  },
  {
    "content_description": "The landlord's young master Fugui was addicted to gambling and finally gambled all his family wealth. Fugui, who was in poverty, went to seek medical treatment because his mother was ill. Unexpectedly, he was caught by the Kuomintang troops on the way and captured by the people's Liberation Army. When he returned to his hometown, he knew that his mother had died. His wife Jiazhen had brought up a pair of children through hardships, but his daughter unfortunately became deaf and mute, My son is smart and lively... However, the real tragedy began to unfold gradually from then on. The rare warmth in life will be torn to pieces by death again and again, leaving only the old Fugui with an old cow in the sun.",
    "ISBN": "978754421096",
    "name": "Living",
    "author": "Yu Hua",
    "price": "12.00",
    "press": "Nanhai publishing company",
    "score": "9.1",
    "link": "https://book.douban.com/subject/1082154/",
    "author_profile": "Yu Hua, a native of Haiyan, Zhejiang Province, was born in Hangzhou, Zhejiang Province in 1960. Later, he moved to Haiyan County with his parents. Yu Hua is a representative of Chinese avant-garde novels.",
    "date": "1998-5",
    "page": "195",
    "cover": "Living.jpg"
  },
  {
    "content_description": "Amir, a 12-year-old Afghan rich young master, is brotherly with his servant Hassan. However, after a kite competition, a tragic thing happened. Amir felt remorse and pain for his cowardice and forced Hassan away. Soon, he also fled to the United States with his father. As an adult, Amir could not forgive his betrayal of Hassan. In order to atone, Amir set foot in his hometown for more than 20 years, hoping to make the last effort for his unfortunate friends, but found a shocking lie, and his childhood nightmare repeated again. How should Amir choose.",
    "ISBN": "978720806164",
    "name": "The Kite Runner",
    "author": "Khaled Hosseini",
    "price": "6.00",
    "press": "Shanghai People's Publishing House",
    "score": "8.8",
    "link": "https://book.douban.com/subject/1770782/",
    "author_profile": "Khaled Hosseini was born in Kabul, Afghanistan in 1965 and moved to the United States with his father. Husseini graduated from the Department of medicine at the University of California, San Diego and now lives in California. Determined to brush away the dust on the faces of ordinary people in Afghanistan and show the throbbing of the soul behind them to the world. More than 40 million copies have been sold worldwide. In 2006, because of the great international influence of his works, Husseini won the United Nations Humanitarian Award and was invited to serve as the goodwill ambassador of UNHCR.",
    "date": "2006-5",
    "page": "362",
    "cover": "TheKiteRunner.jpg"
  },
  {
    "content_description": "《Fortress Besieged》 is a novel written by Qian Zhongshu. Many people think this is a humorous work. In addition to the distinctive characters' language, the words described by the author are also witty and humorous. This is a major feature of this book. Others believe that this is because the author shows off his words and the language is sour.",
    "ISBN": "978702002475",
    "name": "Fortress Besieged",
    "author": "Qian Zhongshu",
    "price": "5.00",
    "press": "People's Literature Publishing House",
    "score": "8.9",
    "link": "https://book.douban.com/subject/1008145/",
    "author_profile": "Qian Zhongshu (1910-1998), a famous writer and literary researcher in modern China. He graduated from the Foreign Language Department of Tsinghua University with a Bachelor of Arts. He went to Shanghai to teach at Guanghua University. Later, he was admitted to the third (1935) gengzi compensation public expense study abroad qualification and ranked first in the list. He studied at Exeter college, Oxford University, UK. After graduating from University, he taught in many colleges and universities. He died in 1998 at the age of 88.",
    "date": "1991-2",
    "page": "359",
    "cover": "City.jpg"
  },
  {
    "content_description": "The little prince is a fairy. He lives on an asteroid just a little bigger than him. He was accompanied by a little rose that he loved very much. But the vanity of the rose hurt the little prince's feelings for her. The little prince said goodbye to the asteroid and began his journey into space. He visited six planets successively. Only on one of the lighters' planets did the little prince find someone who could be a friend. But the world of the lamplighter is very narrow, and there is no room for a second person except the lamplighter himself. Under the guidance of geographers, the lonely little prince came to the earth where human beings live. The little prince found that human beings lacked imagination and only repeated what others had said like parrots. The little prince was thinking more and more about the little rose on his planet. Later, the little prince met a little fox. The little prince conquered the little fox with patience and formed close friends with it. The little fox gave the secret in his heart as a gift to the little prince. With this secret, the little prince found the spring of life with the pilot in distress in the Sahara desert. Finally, the little prince left the earth with the help of the snake and returned to his asteroid B612.",
    "ISBN": "978702004249",
    "name": "The little prince",
    "author": "Antoine de Saint-Exupery",
    "price": "7.00",
    "press": "People's Literature Publishing House",
    "score": "9.0",
    "link": "https://book.douban.com/subject/1084336/",
    "author_profile": "Antoine de Saint Exupery (1900-1944) was born in Lyon, France, on June 29, 1900. He once wanted to apply for the Naval Academy, but failed to do so, but he was lucky to become a member of the air force. After retiring in 1923, he has engaged in various occupations. In 1926, St. Exupery entered latecoel airlines. He returned to the Allied Mediterranean air force in 1944. On a flight mission on July 31 of that year, he flew into the blue sky and never came back.",
    "date": "2003-8",
    "page": "97",
    "cover": "Prince.jpg"
  },
   {
    "content_description": "This book is a general history of the United States, written by Mr Foner, a leading contemporary American historian. It begins with the earliest European explorers' arrival in the Americas and their conquest of the New World, and continues through the political, social, intellectual and cultural aspects of the United States under President Obama's administration in 2014, in an attempt to present a cutting-edge, inclusive narrative of American history. The book is also the culmination of a 'new American historiography' that takes a 'bottom-up' approach to the study of 'freedom' and seamlessly integrates the findings of the new social history into a reinterpretation of classic American historiographical topics. It presents a general history of the United States reconstructed from a multifaceted and interactive view of history by highlighting the historical experiences of American groups that have been ignored by traditional historiography. The book emphasises the most important events, individuals and themes in American history, but focuses on the experiences of both prominent leaders and ordinary Americans, as well as on the historical experiences of the diverse groups that make up American society. With its strong views, thoughtfulness, knowledge and fine writing, the book has been well received and enjoyed by many readers at home and abroad.\n",
    "ISBN": "9787100154635",
    "name": "Give Me Liberty! An American History",
    "author": "[American] Eric Foner",
    "price": "176.90yuan",
    "press": "The Commercial Press",
    "score": "8.1",
    "link": "https://book.douban.com/subject/27176334/",
    "author_profile": "Eric Foner is one of the most influential historians of our time. He is the long-standing DeWitt Clinton Professor of History at Columbia University and has written extensively in the fields of American Civil War and Reconstruction history, African-American history, slavery history, American political culture and intellectual history, and Lincoln studies. He has published nearly 30 books, many of which have become classics of American history for their solid historical information, original views, profound ideas and exquisite writing. His major works include Free Land, Free Labour, Free Men: The Ideology of the Republican Party before the Civil War (1970), Tom Penn and Revolutionary America (1976), Reconstruction: The Unfinished Revolution in America (1863-1877) (1988, winner of six academic prizes including the Bancroft Prize), The Story of American Freedom (1998), The Flames of Fire (1998) and The Story of American Freedom (1998). (1998), Trial by Fire: Lincoln and American Slavery (2010, winner of seven scholarly awards, including the Pulitzer Prize, the Lincoln Prize, and the Bancroft Prize), and The Road to Freedom: The Secret History of the \"Underground Railroad\" (2015), and has had several books translated into Chinese, Japanese, Italian, Korean, Spanish, and Portuguese. His scholarship is highly regarded and widely influential worldwide.\n\nHe is a member of the National Academy of Arts and Sciences, an elected corresponding member of the Royal Academy of Sciences, and has been President of the Organization of American Historians (1993), President of the American Historical Association (2000), President of the American Association of Historians (2006), twice honoured as a \"Great Teacher\" by Columbia University, and a member of the faculties of the University of London and Princeton University. He has been awarded honorary doctorates by the University of London, Princeton University and others.\n",
    "date": "2017-12",
    "page": "1429",
    "cover": "s29780389.jpg"
  },
  {
    "content_description": " A boat.\n　　A journey of dreams.\n　　Huge, imposing and luxurious.\n　　Ribbons fluttering and bunting flying. Drums and music and people.\n　　The colours that the picture has only exist in our senses, and what is shown to us is a single yellow colour, as if it were an old photograph of how many years past, an old thing that has passed through countless springs and autumns. It is as if we can brush off the dust of the years, count the years, and relish the dream of the past.\n　　MyHeartGoOn - a song for women's voices that seems to have come from the sky, echoing in our ears with an airy, vast and bold feeling. The song rises and falls, the song sings, but it is also lingering and lyrical.\n",
    "ISBN": "9787560027661",
    "name": "Titanic",
    "author": "[American] Michael Potter",
    "price": "17.60yuan",
    "press": "Foreign Language Teaching and Research Press",
    "score": "9.3",
    "link": "https://book.douban.com/subject/1229336/",
    "author_profile": "The author of the original novel of the same name for Titanic was Schultzman.\n",
    "date": "2002-6-1",
    "page": "52",
    "cover": "s2188628.jpg"
  }
]