[{"rate":"8.6","title":"werk ohne autor","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2529384763.jpg","movie_url":"https://www.imdb.com/title/tt5311542/?ref_=fn_al_tt_1","info":"　　1937 besucht der fünfjährige Kurt Barnert mit seiner jungen kunstsinnigen Tante Elisabeth die Wanderausstellung Entartete Kunst in Dresden. Beiden gefallen die ausgestellten, vom Nazi-Regime verpönten Werke. Bald darauf muss das Kind mitansehen, wie eben diese Tante wegen vermeintlicher Schizophrenie in eine psychiatrische Anstalt zwangseingeliefert wird."},
{"rate":"7.7","title":"my best friend","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2502733407.jpg","movie_url":"https://www.imdb.com/title/tt6400166/?ref_=fn_al_tt_1","info":"　　Lorenzo (Angelo Mutti Spinetta), a teenager who lives in Patagonia, receives Caíto (Lautaro Rodríguez), the son of some friends of the family who are going through a serious situation and cannot take care of him. Caíto is a troubled young man who has difficulty adapting. In spite of the differences they have a peculiar friendship, where each one learns a lot from the other. One day Caíto tells him the real reason why he had to leave his house. From then on, Lorenzo will have to take charge of a secret too heavy to carry..."},
{"rate":"7.6","title":"ocean's 8","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2508259902.jpg","movie_url":"https://www.imdb.com/title/tt5164214/","info":"　　Newly paroled con artist Debbie Ocean, the late Danny Ocean's younger sister, convinces former partner-in-crime Lou to join her in a new heist. They assemble their team: bankrupt fashion designer Rose Weil, who is in debt to the IRS; jewelry maker Amita, who is eager to move out of her mother's house; security hacker Nine Ball; street hustler and pickpocket Constance; and profiteer Tammy, who fences stolen goods out of her suburban home..."},
{"rate":"7.1","title":"London Fields","image":"https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2524161946.jpg","movie_url":"https://www.imdb.com/title/tt1273221/?ref_=nv_sr_srsg_0","info":"　　Nicola Six has clairvoyant powers and discovers that she will die at the hands of one man. She begins an affair with three men to discover which of them is the killer..."},
{"rate":"7.9","title":"Greta","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2546900503.jpg","movie_url":"https://www.imdb.com/title/tt2639336/?ref_=nv_sr_srsg_5","info":"　　Frances McCullen (Chloë Grace Moretz) is a young waitress living in New York City with her friend and roommate Erica (Maika Monroe). Frances is still reeling from the death of her mother one year prior, and maintains a strained relationship with her workaholic father Chris (Colm Feore). One morning, Frances finds a handbag on a subway train; the ID inside confirms the bag belongs to a Greta Hideg (Isabelle Huppert). Frances visits Greta the next day to return the bag and Greta invites her in for a cup of coffee..."},
{"rate":"7.0","title":"The Perfection","image":"https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2553727576.jpg","movie_url":"https://www.imdb.com/title/tt7772580/","info":"　　Charlotte Willmore is a talented young cellist who was forced to leave Bachoff, a prestigious music school in Boston, to care for her terminally ill mother. After her mother's death years later, Charlotte reaches out to Anton, the head of the academy, and travels to Shanghai to join him, his wife Paloma, and teachers Geoffrey and Theis in selecting a new student. Charlotte befriends Lizzie, Anton's star pupil who replaced Charlotte at Bachoff. After a night of clubbing, they return to Lizzie's hotel room and have sex..."},
{"rate":"9.7","title":"The Shacwshank Redemption ","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p480747492.jpg","movie_url":"https://www.imdb.com/title/tt0111161/?ref_=fn_al_tt_1","info":"hrian and uses his financial knowledge to help prison officers avoid taxes, which attracts the attention of the warden and he is recruited to help him launder money. By chance, he learns that a newly imprisoned thief can testify to clear him of murder. With a glimmer of hope, Andy approaches the warden in the hope that he can get his case overturned. The sinister and hypocritical warden pretends to promise Andy, but behind his back he sends someone to kill the thief, killing his only hope of getting out of prison legally. Frustrated, Andy doesn't despair and one stormy night, a decades-old plan to escape from prison redeems himself and sets him free! Inspired and helped by him, his old friend Reed also runs bravely to freedom.\n"},
{"rate":"9.4","title":"Titanic","image":"https://img3.doubanio.com/view/photo/s_ratio_poster/public/p457759533.jpg","movie_url":"https://www.imdb.com/title/tt0120338/?ref_=nv_sr_srsg_0","info":"On 10 April 1912, the luxury passenger ship Titanic, known as \"the wonder of the world's industrial history\", begins its maiden voyage from Southampton, England, to New York, USA. Wealthy teenager Rose (Kate Winslet) sits in first class with her mother and fiancé Carl; on the other side, debonair teenage painter Jack (Leonardo DiCaprio) also wins a ticket to lower class in a gamble at the docks.\n　　Tired of the hypocrisy of high society and unwilling to marry Karl, Rose plans to throw herself overboard and is rescued by Jack. Soon the beautiful and vivacious Rose falls in love with the handsome and cheerful Jack, who takes Rose to lower-class balls and paints her portrait, and their relationship grows.\n　　On Sunday night, 14 April 1912, a calm and quiet night. When the Titanic hits an iceberg, the 'unsinkable' Titanic faces sinking and Rose and Jack's budding love is put to the test of life and death.\n"}
]

